import React from 'react'

function AmProgramming_tips() {
  return (
    <div>
      <h1>Կոդի խմբագրիչների համեմատություն</h1>

      <h3>Notepad++, Sublime Text, Visual Studio Code, Atom, WebStorm</h3>

<b>1. Notepad++</b>

<p>+ դրական կողմերը</p>

<p>• Արագ և թեթև կոդի խմբագրիչ</p>

<p>• Աջակցում է ծրագրավորման լեզուների և ֆայլերի ձևաչափերի լայն շրջանակ</p>

<p>• Ընդարձակելի է պլագինների և սկրիպտների միջոցով</p>

<p>• Անվճար և բաց կոդով</p>

<p>- բացասական կողմերը</p>

<p>• Ծրագրի կառավարման սահմանափակ հնարավորություններ</p>

<p>• Ինտերֆեյսը կարող է լինել խառնաշփոթ և անհասկանալի</p>

<p>• Կարող է հարմար չլինել խոշոր նախագծերի կամ համագործակցային զարգացման համար</p>

<p>Դուք կարող եք ներբեռնել Notepad++-ը իր պաշտոնական կայքից՝ <a href=" https://notepad-plus-plus.org/" target='_blank' >👉🏼 Notepad++</a></p>

<b>2. Sublime Text</b>

<p>+ դրական կողմերը</p>

<p>• Արագ և հարմարեցվող կոդերի խմբագրիչ</p>

<p>• Աջակցում է բազմաթիվ կուրսորների և ֆունկցիաներ գտնելու և փոխարինելու</p>

<p>• Ունի մեծ թվով պլագիններ և թեմաներ</p>

<p>• Հարմար է փոքր և մեծ նախագծերի համար</p>

<p>- բացասական կողմերը</p>

<p>• Վճարովի (չնայած առաջարկում է անսահմանափակ անվճար փորձաշրջան)</p>

<p>• Ծրագրի կառավարման սահմանափակ հնարավորություններ</p>

<p>• Կարող է շատ ռեսուրս պահանջել, հատկապես մեծ ֆայլերի կամ նախագծերի հետ աշխատելիս</p>

<p>Դուք կարող եք ներբեռնել Sublime Text-ը իր պաշտոնական կայքից՝ <a href="https://www.sublimetext.com/" target='_blank' >👉🏼 Sublime Text</a></p>

<b>3. Visual Studio Code</b>

<p>+ դրական կողմերը</p>

<p>• Հզոր և բազմակողմանի կոդերի խմբագրիչ՝ հնարավորությունների լայն շրջանակով</p>

<p>• Աջակցում է բազմաթիվ ծրագրավորման լեզուներ և ֆայլերի ձևաչափեր</p>

<p>• Ընդարձակելի է մեծ թվով պլագինների և ընդլայնումների միջոցով</p>

<p>• Ներկառուցված վրիպազերծման գործիքներ և Git-ի ինտեգրում</p>

<p>- բացասական կողմերը</p>

<p>• Կարող է շատ ռեսուրս պահանջել, հատկապես մեծ ֆայլերի կամ նախագծերի հետ աշխատելիս</p>

<p>• Կտրուկ ուսուցման շեմ՝ որոշ առաջադեմ հնարավորությունների համար</p>

<p>• Արդյունավետ օգտագործման համար անհրաժեշտ է որոշակի կարգավորում և նախապատրաստում</p>

<p>Դուք կարող եք ներբեռնել Visual Studio Code-ը իր պաշտոնական կայքից՝ <a href="https://code.visualstudio.com/" target='_blank' >👉🏼 Visual Studio Code</a> </p>

<b>4. Atom</b>

<p>+ դրական կողմերը</p>

<p>• Անվճար և բաց կոդերի խմբագրիչ՝ ժամանակակից և հարմարեցվող ինտերֆեյսով</p>

<p>• Աջակցում է բազմաթիվ ծրագրավորման լեզուներ և ֆայլերի ձևաչափեր</p>

<p>• Հասանելի են մեծ թվով պլագիններ և փաթեթներ</p>

<p>• Հարմար է ինչպես փոքր, այնպես էլ մեծ նախագծերի համար</p>

<p>- բացասական կողմերը</p>

<p>• Կարող է սպառել շատ ռեսուրսներ, հատկապես խոշոր նախագծերի կամ բազմաթիվ փաթեթների դեպքում</p>

<p>• Որոշ գործառույթներ կարող են պահանջել պլագիններ կամ փաթեթներ</p>

<p>• Որոշ դեպքերում ինտերֆեյսը կարող է դանդաղ լինել կամ չպատասխանել</p>

<p>Դուք կարող եք ներբեռնել Atom-ը նրա պաշտոնական կայքից՝ <a href="https://atom.io/" target='_blank' > 👉🏼 Atom</a></p>

<b>5. WebStorm</b> 

<p>+ դրական կողմերը</p>

<p>• Կոդերի համապարփակ և հզոր խմբագրիչ, որը հատուկ նախագծված է վեբ մշակման համար</p>

<p>• Աջակցում է վեբ տեխնոլոգիաների և շրջանակների լայն շրջանակ</p>

<p>• Ներկառուցված վրիպազերծման գործիքներ և Git-ի ինտեգրում</p>

<p>• Ներառում է արտադրողականության բազմաթիվ առանձնահատկություններ, ինչպիսիք են կոդի լրացումը և վերամշակումը</p>

<p>- բացասական կողմերը</p>

<p>• Վճարովի (չնայած այն առաջարկում է 30 օր անվճար փորձաշրջան)</p>

<p>• Կարող է սպառել շատ ռեսուրսներ, հատկապես խոշոր նախագծերի հետ աշխատելիս</p>

<p>• Կարող է հարմար չլինել ծրագրավորողների համար, ովքեր աշխատում են հիմնականում ոչ վեբ տեխնոլոգիաներով</p>

<p>Դուք կարող եք ներբեռնել WebStorm-ը իր պաշտոնական կայքից՝ <a href="https://www.jetbrains.com/webstorm/" target='_blank' >👉🏼 WebStorm</a></p>

<p> Սկսնակների համար <b>Notepad++</b>-ը լավ ընտրություն է, քանի որ այն պարզ և թեթև կոդերի խմբագրիչ է, որը հեշտ է օգտագործել: Այնուամենայնիվ, այն չի առաջարկում այնպիսի գործառույթներ, ինչպիսիք են ավտոմատ լրացումը կամ վրիպազերծումը, ինչը կարող է դժվարացնել կոդ գրելը և վրիպազերծումը սկսնակների համար: Հետևաբար, որպես սկսնակ, խորհուրդ է տրվում սկսել Notepad++-ից և աստիճանաբար անցնել ավելի առաջադեմ խմբագրիչների:</p>

<p><b>Sublime Text</b>-ը արագ և շատ հարմարեցված կոդերի խմբագրիչ է, որը հարմար է փոքր և մեծ նախագծերի համար: Այն ունի որոնման և փոխարինման հզոր գործառույթ և աջակցում է բազմաթիվ կուրսորներ, որոնք կարող են խնայել ժամանակը և բարձրացնել արտադրողականությունը: Այնուամենայնիվ, այն անվճար չէ և չի առաջարկում ներկառուցված վրիպազերծման գործիքներ, որոնք կարող են հարմար չլինել սկսնակների համար:</p>

<p><b>Visual Studio Code</b>-ը բազմակողմանի և հզոր կոդերի խմբագրիչ է, որն ունի լայն հնարավորություններ, ինչը հարմար է դարձնում ինչպես սկսնակների, այնպես էլ առաջադեմ օգտատերերի համար: Այն աջակցում է բազմաթիվ ծրագրավորման լեզուներ և ֆայլերի ձևաչափեր, ունի ներկառուցված վրիպազերծման գործիքներ և Git ինտեգրում, ինչը կարող է օգնել սկսնակներին ավելի հեշտությամբ վրիպազերծել և կառավարել իրենց կոդը:</p>

<p><b>Atom</b>-ը անվճար և բաց կոդով խմբագիր է՝ ժամանակակից և հարմարեցվող ինտերֆեյսով: Այն աջակցում է բազմաթիվ ծրագրավորման լեզուներ և ֆայլերի ձևաչափեր և ունի մեծ թվով պլագիններ և փաթեթներ, որոնք կարող են օգնել սկսնակներին հարմարեցնել իրենց խմբագրիչը և ավելացնել նոր հնարավորություններ: Այնուամենայնիվ, այն կարող է սպառել շատ ռեսուրսներ, ինչը կարող է դանդաղեցնել խմբագրի աշխատանքը:</p>

<p><b>WebStorm</b>-ը համապարփակ և հզոր կոդերի խմբագրիչ է, որը հատուկ նախագծված է վեբ մշակման համար: Այն աջակցում է վեբ տեխնոլոգիաների և շրջանակների լայն տեսականի և ներառում է ներկառուցված վրիպազերծման գործիքներ և Git ինտեգրում: Այն նաև առաջարկում է մի շարք արտադրողականության առանձնահատկություններ, ինչպիսիք են ավտոմատ լրացումը և վերամշակումը, որոնք կարող են օգնել սկսնակներին գրել և կառավարել իրենց ծածկագիրը ավելի արդյունավետ: Այնուամենայնիվ, այն անվճար չէ և կարող է հարմար չլինել ծրագրավորողների համար, ովքեր հիմնականում աշխատում են ոչ վեբ տեխնոլոգիաներով:</p>

<p>Ամփոփելով, <b>սկսնակների համար</b>, Notepad++-ը լավ տեղ է սկսելու համար, սակայն խորհուրդ է տրվում աստիճանաբար անցնել ավելի առաջադեմ խմբագրիչների, ինչպիսիք են Visual Studio Code-ը կամ WebStorm-ը՝ կախված նրանց հատուկ կարիքներից և նախասիրություններից:</p>

<h1>Ubuntu</h1>

<p>Ubuntu-ն Linux միջուկի հանրաճանաչ բաշխում է, որն անվճար է, բաց կոդով և հեշտ օգտագործման համար, ինչը հիանալի ընտրություն է այն սկսնակների համար, ովքեր ցանկանում են սովորել ծրագրավորում: Ubuntu-ն ապահովում է զարգացման հզոր գործիքների և ծրագրավորման լեզուների լայն շրջանակ, որոնք կարող են օգնել սկսնակներին արագ սկսել:</p>

<p>Բացի այդ, Ubuntu-ն ունի մեծ և աջակցող համայնք, որն ապահովում է լայնածավալ փաստաթղթեր, ձեռնարկներ և ֆորումներ՝ օգնելու սկսնակներին սովորել ծրագրավորում և լուծել ցանկացած խնդիր, որին նրանք կարող են հանդիպել:</p>

<p>Նաև Linux-ի օգտագործումը կարող է օգտակար լինել սկսնակների համար, քանի որ այն ապահովում է ավելի հարմարեցված և անվտանգ միջավայր, քան Windows-ը կամ macOS-ը: Այն նաև թույլ է տալիս ավելի լավ վերահսկել համակարգի ռեսուրսները, ինչը կարող է օգտակար լինել ռեսուրսներ պահանջող հավելվածներով աշխատող ծրագրավորողների համար:</p>

<p>Մինչ Մարկ Շաթլվորթը Canonical-ի հիմնադիրն է և Ubuntu-ի շարժիչ ուժը, նրա աշխատանքը հիմնված է Լինուս Թորվալդսի և Linux համայնքի կողմից դրված հիմքի վրա: Linux-ն այն միջուկն է, որն ապահովում է Ubuntu-ն, և բաց կոդով մշակման սկզբունքները, որոնք պաշտպանում են ինչպես Torvalds-ը, այնպես էլ Shuttleworth-ը, այն են, ինչը Ubuntu-ին դարձրել է հաջողակ և լայնորեն օգտագործվող օպերացիոն համակարգ: Երկու անհատներն էլ առանցքային դեր են խաղացել բոլորի համար անվճար և մատչելի տեխնոլոգիական ծրագրաշարի լանդշաֆտի ձևավորման գործում:</p>

<p>Եթե ցանկանում եք փորձել Ubuntu-ն, կարող եք ներբեռնել վերջին տարբերակը Ubuntu-ի պաշտոնական կայքից՝ <a href="https://ubuntu.com/download/desktop" target='_blank'>👉🏼 Ubuntu</a></p>

<h1>Git և GitHub սկսնակների համար. հիմնական հասկացություններ և հրամաններ</h1>
   
<p> Git-ը տարբերակի կառավարման համակարգ է, որը թույլ է տալիս ժամանակի ընթացքում հետևել ձեր կոդի փոփոխություններին: Այն թույլ է տալիս աշխատել կոդերի բազայի պատճենի հետ, փոփոխություններ կատարել և փորձարկել դրանք՝ չազդելով ուրիշների աշխատանքի վրա: Git-ը նաև հեշտացնում է կոդի շուրջ համագործակցությունը և անհրաժեշտության դեպքում հետաձգել փոփոխությունները:</p>

<p>GitHub-ը առցանց հարթակ է, որը հյուրընկալում է Git-ի պահոցները և հեշտացնում է կոդի շուրջ համագործակցությունը: GitHub-ն ունի վեբ ինտերֆեյս՝ պահեստները կառավարելու համար, որոնք պարզապես ֆայլերի և թղթապանակների հավաքածուներ են՝ այդ ֆայլերի փոփոխությունների ամբողջական պատմության հետ միասին: GitHub-ը ծրագրավորողներին թույլ է տալիս ստեղծել նոր պահոցներ, փոփոխություններ մտցնել գոյություն ունեցող պահոցներում և համագործակցել ուրիշների հետ ընդհանուր պահոցներում:</p>

<p>Եթե դուք նոր եք Git-ում և GitHub-ում, ապա ավելի լավ է սկսել հիմնական հասկացություններից, ինչպիսիք են պահեստները, պարտավորությունները, ճյուղերը և միաձուլումները: Շատ առցանց ռեսուրսներ և ձեռնարկներ առաջարկում են ավելի պարզ բացատրություններ, որոնք կօգնեն ձեզ արագացնել այս տեխնոլոգիաները:</p>

<p>Ահա մի քանի հիմնական Git հրամաններ՝ սկսելու համար.</p>

<p>• git init -ը սկզբնավորում է նոր Git պահոց</p>

<p>• git add -ը փոփոխություններ է ավելացնում նախապատրաստության տարածքում(staging area)</p>

<p>• git commit -ը պահպանում է փոփոխությունները պահոցում commit հաղորդագրությամբ</p>

<p>• git status -ը ցույց է տալիս պահոցում փոփոխությունների կարգավիճակը</p>

<p>• git log -ը ցուցադրում է պահեստի բոլոր պարտավորությունների գրանցամատյանը</p>

<p>• git branch -ը ցուցադրում է պահոցի բոլոր ճյուղերի ցանկը</p>

<p>• git checkout -ը անցում է ճյուղերի միջև կամ կատարում</p>

<p>• git merge -ը միաձուլում է փոփոխությունները մի ճյուղից մյուսը</p>

<p>Ահա մի քանի հիմնական GitHub հրամաններ</p>

<p>• git clone -ը պատճենում է պահոցը GitHub-ից ձեր լոկալ համակարգչի վրա</p>

<p>• git push -ը տեղափոխում է փոփոխությունները ձեր լոկալ պահոցից դեպի հեռավոր GitHub պահոց</p>

<p>• git pull -ը տեղափոխում է փոփոխությունները հեռավոր GitHub պահոցից դեպի ձեր լոկալ պահոց</p>

<p>• git fetch -ը առբերում է փոփոխությունները հեռավոր GitHub պահոցից՝ առանց դրանք միացնելու ձեր լոկալ պահոցին</p>







    </div>
  )
}

export default AmProgramming_tips;